wikimedia/smash-pig/PaymentProviders/Gravy/Tests/Data/buyer-cancel-approval-from-redirect.json

{
    "type": "transaction",
    "id": "1825b241-e32e-4193-8c5c-2fd85a6ec2a7",
    "reconciliation_id": "jZ2fj3XOe4V4qET0fE2Y3",
    "merchant_account_id": "default",
    "currency": "USD",
    "amount": 1223,
    "status": "authorization_failed",
    "authorized_amount": 0,
    "captured_amount": 0,
    "refunded_amount": 0,
    "settled_currency": null,
    "settled_amount": 0,
    "settled": false,
    "country": "US",
    "external_identifier": "165.2",
    "intent": "authorize",
    "payment_method": {
        "type": "payment-method",
        "approval_url": null,
        "country": "US",
        "currency": "USD",
        "details": null,
        "expiration_date": null,
        "fingerprint": null,
        "label": null,
        "last_replaced_at": null,
        "method": "paypal",
        "mode": "redirect",
        "scheme": null,
        "id": null,
        "approval_target": null,
        "external_identifier": null,
        "payment_account_reference": null
    },
    "method": "paypal",
    "instrument_type": "redirect",
    "error_code": "cancelled_buyer_approval",
    "payment_service": {
        "type": "payment-service",
        "id": "0387563a-ff51-4346-bcfc-fa40dcddd4a4",
        "payment_service_definition_id": "paypal-paypal",
        "method": "paypal",
        "display_name": "PayPal"
    },
    "pending_review": false,
    "buyer": null,
    "raw_response_code": null,
    "raw_response_description": null,
    "shipping_details": null,
    "checkout_session_id": null,
    "gift_card_redemptions": [],
    "gift_card_service": null,
    "created_at": "2025-09-11T14:25:34.043846+00:00",
    "updated_at": "2025-09-11T14:27:48.058625+00:00",
    "disputed": false,
    "airline": null,
    "auth_response_code": null,
    "avs_response_code": null,
    "cvv_response_code": null,
    "anti_fraud_decision": null,
    "payment_source": "ecommerce",
    "merchant_initiated": false,
    "is_subsequent_payment": false,
    "cart_items": [],
    "statement_descriptor": {
        "name": null,
        "description": "Wikimedia Foundation",
        "city": null,
        "country": null,
        "phone_number": null,
        "url": null
    },
    "scheme_transaction_id": null,
    "three_d_secure": null,
    "payment_service_transaction_id": "8TP27001TB5741330",
    "additional_identifiers": {
        "payment_service_authorization_id": null,
        "payment_service_capture_id": null,
        "payment_service_processor_id": "8TP27001TB5741330"
    },
    "metadata": null,
    "authorized_at": null,
    "captured_at": null,
    "voided_at": null,
    "canceled_at": null,
    "approval_expires_at": null,
    "buyer_approval_timedout_at": null,
    "intent_outcome": "failed",
    "multi_tender": false,
    "account_funding_transaction": false,
    "recipient": null,
    "merchant_advice_code": null,
    "installment_count": null
}